ffreitasb/phonemefree-unplugged/sdkconfig.defaults
# PhonemeFree Unplugged reference target
CONFIG_IDF_TARGET="esp32s3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Reference boards should expose at least 4 MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Reference build I2S pinout
CONFIG_PHONEMEFREE_UNPLUGGED_I2S_BCK_PIN=4
CONFIG_PHONEMEFREE_UNPLUGGED_I2S_WS_PIN=5
CONFIG_PHONEMEFREE_UNPLUGGED_I2S_DATA_PIN=6
CONFIG_PHONEMEFREE_UNPLUGGED_I2S_PORT=0

# Audio buffers
CONFIG_PHONEMEFREE_UNPLUGGED_RINGBUF_SAMPLES=512
CONFIG_PHONEMEFREE_UNPLUGGED_DSP_OUTPUT_SAMPLES=512
CONFIG_FREERTOS_HZ=1000

# Task sizing
CONFIG_PHONEMEFREE_UNPLUGGED_DSP_TASK_STACK_SIZE=8192
CONFIG_PHONEMEFREE_UNPLUGGED_I2S_TASK_STACK_SIZE=4096
CONFIG_PHONEMEFREE_UNPLUGGED_USB_TASK_STACK_SIZE=4096
CONFIG_PHONEMEFREE_UNPLUGGED_WIFI_TASK_STACK_SIZE=4096
CONFIG_PHONEMEFREE_UNPLUGGED_WEBSERVER_TASK_STACK_SIZE=6144

# Feature gates
CONFIG_PHONEMEFREE_UNPLUGGED_FORMANT_ENABLE=n
CONFIG_HTTPD_WS_SUPPORT=y

# TinyUSB/UAC is implemented in usb_audio_uac. ESP-IDF 6.0.1 and the
# espressif/tinyusb component do not expose the older audio Kconfig symbols here.
